This is a data exploration with the seaborn graphics library. Inspired on https://gist.github.com/mwaskom/8224591

In [17]:
import numpy as np
import pandas as pd
import seaborn as sns

In [12]:
url = "https://raw.github.com/mattdelhey/kaggle-titanic/master/Data/train.csv"
titanic = pd.read_csv(url)
titanic.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Working trough this sort notebooks of other people is alway great fun. Below I found the way how you can easily map a column with ```pandas```. In SQL you'll use for this most of the time a ```case when``` statement. However, with ```pandas``` you can use the map function as seen below.

In [16]:
titanic["embark_town"] = titanic.embarked.map({"C" : "Cherbourg", "Q" : "Queenstown", "S" : "Southampton"})
titanic["class"] = titanic.pclass.map({1: "First", 2: "Second", 3: "Third"})
titanic["alive"]= titanic.survived.map({0 : "No", 1: "Yes"})

Create a function to make a new column "who" with the instances man, woman and child.

In [31]:
def woman_child_or_man(passenger):
    age, sex = passenger
    if age < 16:
        return "child"
    else:
        return dict(male="man", female="woman")[sex]

In [34]:
titanic["who"] = titanic[["age", "sex"]].apply(woman_child_or_man, axis=1)

In [33]:
titanic["who"]

0        man
1      woman
2      woman
3      woman
4        man
5        man
6        man
7      child
8      woman
9      child
10     child
11     woman
12       man
13       man
14     child
15     woman
16     child
17       man
18     woman
19     woman
20       man
21       man
22     child
23       man
24     child
25     woman
26       man
27       man
28     woman
29       man
       ...
861      man
862    woman
863    woman
864      man
865    woman
866    woman
867      man
868      man
869    child
870      man
871    woman
872      man
873      man
874    woman
875    child
876      man
877      man
878      man
879    woman
880    woman
881      man
882    woman
883      man
884      man
885    woman
886      man
887    woman
888    woman
889      man
890      man
Name: who, dtype: object